[{"date": "2021-03-12T19:46:47Z", "title": "Challenge Competitor Kyle Christie Is Going To Be A Dad", "full_article": "Kyle Christie is about to embrace a brand-new, exciting challenge: The MTV competitor and girlfriend Vicky Turner are expecting their first child!https://www.instagram.com/p/CMVFtTEMLYz/?igshid=1pfbcn119zpxe\"Little bit of you & a little bit of me......that’s what it takes to make Family,\" the Geordie Shore alum captioned the sweet Instagram announcement. \"I promise you, kid, you are going to have one hell of life. Baby Christie due September.\"Vicky shared the same snapshot and added, \"Half of me and half of you.\"Kyle's Challenge cast members were quick to congratulate their comrade. Nany Gonzalez commented \"Oh my GOODNESS!!!! CONGRATS,\" while Kam Williams offered \"Omgggg congrats guys!!!! I’m so happy for you both.\" Jenna Compono, who is expecting a boy with fiancé Zach Nichols, wrote, \"Hopefully it’s a girl then our babies can get married and you and Zach can be brothers.\" Now that would be something!Offer your congrats to Kyle and Vicky in the comments -- and do not miss the dad-to-be on Double Agents every Wednesday at 8/7c! ", "author": "Jordana Ossad"}, {"date": "2021-03-12T18:38:15Z", "title": "These Are The Most ’90s Moments From The Real World: New York", "full_article": "When Becky Blasband, Andre Comeau, Heather B. Gardner, Julie Gentry, Norman Korpi, Eric Nies and Kevin Powell lived together in the Real World: New York loft back in 1992, beepers and subway tokens were a part of their everyday lives. Fast-forward nearly 30 years later: The roomies are having a homecoming to remember as they reunite for The Real World Homecoming: New York currently streaming on Paramount+. And it's safe to say they won't be using a pager or coins to ride the MTA. And Norman nobody will be upset about Star Trek.To honor how much devices, fashion, food items and pop culture have changed over the years, we're taking a look back at the most '90s moments from the historic reality series. So grab your phone book and Twinkies, and enjoy the Real World throwback above. And be sure to watch episodes of The Real World Homecoming: New York streaming now on Paramount+! ", "author": "Jordana Ossad"}, {"date": "2021-03-12T16:31:44Z", "title": "Bop Shop: Songs From St. Vincent, Chika, Rosé, And More", "full_article": "The search for the ever-elusive \"bop\" is difficult. Playlists and streaming-service recommendations can only do so much. They often leave a lingering question: Are these songs really good, or are they just new?Enter Bop Shop, a hand-picked selection of songs from the MTV News team. This weekly collection doesn't discriminate by genre and can include anything — it's a snapshot of what's on our minds and what sounds good. And all March long, we're celebrating Women's History Month by spotlighting women making music that feels essential to right now.Get ready: The Bop Shop is now open for business.St. Vincent: “Pay Your Way in Pain”https://www.youtube.com/watch?v=ZUTu65AXrJwPain never sounded quite as alluring as it does in this ‘70s-inspired single from St. Vincent, a.k.a. Annie Clark. A funky, sultry cut, “Pay Your Way in Pain” sounds the way indulging a forbidden fantasy feels. It also makes for a delectable first taste of Daddy’s Home, the Grammy-winning musician’s forthcoming new album. Don’t wait up for Daddy, though. She’s scheduled to arrive on May 14. —Sam ManzellaChika: “My Future” (Billie Eilish Cover)The \"future's looking dreamy\" for the Alabama rapper Chika, who celebrated her Best New Artist Grammy nomination by covering a track by last year's winner, Billie Eilish's slow-burning \"My Future.\" Known for her viral freestyles, she put one of her signature quick-lipped verses where Eilish's zonked, distorted musings once were for a jazzy, upbeat outlook on what's to come. \"My present is moving so fast that each passing moment is practically the future already,\" Chika, whose EP Once Upon a Time is out today (March 12), said in a statement. \"And I’m in love with the ride I’m on.” —Coco RomackRosé: “On the Ground”https://www.youtube.com/watch?v=CKZvWhCqx1sIt's here! Finally! With her debut single, “On the Ground,” Blackpink's Rosé taps into her acoustic roots, but with a modern, edgy twist, perfectly balancing her two worlds. Sonically gorgeous, Rosé challenges herself on this seemingly personal anthem about the ramifications of fame, love lost, and the realization that being humble and present is the most important thing, and that “everything [she] needs is on the ground.” Accompanied by an ultra-glam music video filled with luscious florals, beautiful looks (are we surprised?), and fireworks lighting up the sky, Rosé makes her presence known, proving that she can stand out among any industry competitor. For a solo project as highly anticipated as this one, Rosé does not disappoint. Blackpink is — and I cannot stress this enough — truly in your area. —Sarina BhutaniEmily Vu: \"Lila\"https://www.youtube.com/watch?v=LATI5N3JdYQ&feature=youtu.beA follow-your-dreams anthem that comes with a video focusing on the struggles (and the cost) of actually chasing them, \"Lila\" boasts a chorus that's as big as the will to thrive. Newcomer Emily Vu says the song is \"about how shitty it's been\" living and grinding away in Los Angeles. For a few minutes, she makes it sound aspirational anyway. —Patrick HoskenAllison Ponthier: “Cowboy”https://youtu.be/YSuwwzPl5v4Brooklyn-based singer Allison Ponthier is exploring the Wild West of her sexuality in the new cosmic country-pop track, “Cowboy,” from her forthcoming EP. With lyrics like “Saw the cutters through barbed wire / I didn’t know I could come out,” the Texas transplant adds to the canon of queer cowfolk tunes like Willie Nelson’s “Cowboys Are Frequently Secretly Fond of Each Other.” As if that wasn’t enough to get your spurs spinning, the accompanying music video features Ponthier strumming through various desert landscapes before eventually being abducted by aliens, giving off major Madonna “Don’t Tell Me” vibes — if that video had been directed by B-movie maker Ed Wood. Giddy up, space cowboys! —Chris RudolphHorsegirl: \"Ballroom Dance Scene\"https://www.youtube.com/watch?v=qr_oViYr_1sChicago teenage trio Horsegirl recall the early noisiness of Girlpool as much as the deliberate insularity of Belle and Sebastian, creating a forcefield of sound both intrusive and just out of focus. The music's as impressionistic as its DIY abstract video, a fitting document for a band still defining itself. —Patrick HoskenSizzy Rocket: “The World Is Burning”Static and a melancholic piano melody set the tone for “The World Is Burning,” the latest single from L.A.-based indie rocker Sizzy Rocket. “Don't you know you're killing me? / And the heartache is like a pill to me,” Rocket croons. “I'll keep myself high for you.” She’s jaded, sure, but I think she might be onto something. Surrendering has a negative connotation; in love and romance, it’s sometimes “worth the hurting.” —Sam ManzellaLexi Jayde: \"Newbury Park\"https://youtu.be/bMunyisZCKAA pastel sunset ride through SoCal, \"Newbury Park\" is less breezy than its title suggests, instead finding Lexi Jayde tending to a recent heartache. It's dripping with Fleetwood Mac reverence, pop-culture nods (\"you ruined Radiohead\"), profane hooks (\"fuck you for wasting my love\"), and references to driving around — making it the kind of potent, shareable hit that shouts 2021. —Patrick HoskenLucy Dacus: \"Thumbs\"https://www.youtube.com/watch?v=S19BYUvnKjkLucy Dacus began playing the devastating \"Thumbs\" live in late 2018. When she did, she'd ask the audience to please not film it; as such, it remained a fan-favorite communal song that existed only inside venue walls. Now, a recorded version is here, and Dacus has let those barriers fall. Listen, and you might discover why. —Patrick Hosken ", "author": "MTV News Staff"}, {"date": "2021-03-12T02:30:22Z", "title": "‘Here We Go Again’: Gus And Jeremiah Come To Blows On MTV Floribama Shore", "full_article": "Family game night at the the MTV Floribama Shore abode \"was not a success.\" And Jerigus are to blame for its failure. During tonight's brand-new episode, Gus and Jeremiah came to blows yet again, all but squandering their recent hot tub-based cease fire. The previous handshake and hug, and \"starting fresh,\" is null and void. What spawned the brawl? The contests-filled evening featured the crew playing \"Who's the most...\" and the most spoiled, can't keep a secret and biggest drama queen  Aimee taking a bunch of shots.Then the group unanimously decided that Gus was the most insecure, while Jeremiah was chosen as the most entitled.\"Surprise, surprise! I'd like to know exactly why I'm the most entitled. Please!\" Jeremiah pleaded.Codi offered up a definition of entitled (\"someone who thinks they are better than everybody else in the f*cking room\"), while Gus chimed in that \"sometimes you gotta own it, man.\" Kirk's effort to give an example of how Jeremiah can act this way -- like insisting \"I'm not doing this\" to everyone -- infuriated Jeremiah even more.\"Gus hasn't done the same thing?!\" an incredulous Jeremiah spat.\"No, f*ck that! I can honestly say I've never done that,\" Gus yelled back. Jeremiah's \"sideways look\" at Gus and Gus demanding Jeremiah to \"name one instance\" only fanned the flames -- and prompted Gus to stand up. And generate a collective groan among the other roomies.\"Sit down, fool,\" Jeremiah told Gus, who was towering right above him and shouting, \"Stand up.\"\"Call me a fool again, you bitch,\" Gus responded, with a forceful and angry shove. The roommates all screamed \"stop\" at the duo, but it was too late. The altercation turned physical, and eventually they were broken up by security. \"I tried to be the bigger person. I tried to let bygones be bygones, and he comes at me sideways like that?\" a heated post-fight Gus asked in the confessional. \"No, I'm going to put you in your place real quickly. I don't f*cking play those games.\"On the other side, Jeremiah was confused and thought the two had successfully squashed everything in the hot tub.\"Why is this so out of left field?\" Jeremiah wondered. \"Like, are you really this insecure about yourself where you have to pick the biggest guy in the room and prove your manhood? Like, leave me the f*ck alone.\"So \"here we go again\" with these two. Can Jerigus get over this latest setback and reach a resolution? Or will it continue to be unpredictable and rocky between them? Keep watching MTV Floribama Shore on Thursdays at 8/7c to find out.  ", "author": "Jordana Ossad"}, {"date": "2021-03-11T20:00:34Z", "title": "Genera+ion‘s Gritty, Honest Outlook On Gen Z Starts With Its Creator", "full_article": "By Alex GonzalezZelda Barnz has creativity in her blood. Growing up in Los Angeles with a parent in the entertainment industry, she was always surrounded by a diverse, eclectic cast of characters, and her inquisitive nature meant she had a desire to learn about each of them and share their stories. Today the 19-year-old screenwriter is doing just that with Genera+ion, the queer coming-of-age dramedy she crafted while still in high school.With all the stylistic edge of Euphoria and the biting relatability of Degrassi, Genera+ion homes in on the darkness and beauty of being a teenager today. It follows a loosely connected crew of high schoolers as they navigate everything from sexuality and gender identity, to substance use and social media, to all the hyped-up horniness you’d expect from the genre. The first episode introduces Chester (Justice Smith), a gay boy with a provocative fashion sense; Greta (Haley Sanchez), an introverted lesbian; and Nathan, a bisexual boy coming to terms with his sexuality.https://www.instagram.com/p/CMIGLXVpOTk/While LGBTQ+ characters have often been relegated to stereotypical sidekick roles, or limited to coming-out narratives, Zelda places them at the forefront; and while grappling with their queerness is indeed an important struggle, it by no means defines them. Each high schooler faces different challenges in their day-to-day lives. Chester lives with his grandmother after his mom dies from cancer. Greta moves in with her aunt after her mother is deported. Nathan struggles with breaking away from his twin sister Naomi (Chloe East) and creating an identity of his own.“We really tried to focus on queer representation and making sure that when watching our show, queer kids felt really seen,” Zelda says. “All of our queer characters, their personalities are not just about being queer. They have so much more to them than just their sexualities.”When we first meet Nathan, he is curious about Chester. He also struggles to keep his sexuality a secret from Naomi, which proves more difficult after he hooks up with her boyfriend at a party. Zelda was inspired to create Nathan due to a lack of male bisexual characters in film and television. “I think bi men are ignored and often told, ‘It’s just a phase. This is just a stepping stone on the road to coming out as gay,’ which just isn't true,” Zelda says. “Also bi women are often fetishized instead of represented simply as bi women. I definitely think it's very important to have a bi, male character who is just bisexual. And that's there's nothing else complicated with his sexuality.”https://youtu.be/LaW_mdEqwpgZelda, herself, is bisexual. She came out to her parents, Daniel and Ben Barnz at age 15, during a three-week stint at summer camp. The camp’s rules forbade Zelda from using her phone, so she wrote a letter. “I ended with ‘I'm bisexual. Love, Zelda.’ And they wrote back,” Zelda says. “It was not difficult for me, having gay parents, to come out, which I also feel so incredibly lucky for.” While Genera+ion is set within a conservative community, Zelda says she never felt like an outsider.“Growing up in Los Angeles, there are a lot of kids who have gay parents,” Zelda adds. “That was really interesting meeting kids who were adopted like me, or who had gay parents like me. I feel so incredibly lucky to grow up in a space where I never felt like I was the only adopted kid in my class or the only kid with gay parents in my class.”Other aspects of the series are ripped straight from her life, as in the second episode, when Nathan, Greta, and Chester visit their school’s Gay-Straight Alliance club. As a teenager, Zelda was involved in a group at her school called Rainbow Alliance, where she formed friendships with other LGBTQ+ students. Zelda would share stories about Rainbow Alliance meetings with her fathers, who encouraged her to write them down. “These stories were really funny and poignant,” Daniel Barnz says. “Sometimes it was sort of about this person’s struggle, but sometimes it was like, this person showed up at the club meeting, and they were just looking for a date. And [these stories] made me laugh.”Warrick Page / HBO MaxZelda originally planned to write Genera+ion as a novel or a series of short stories based on those Rainbow Alliance meetings, though she dreamed that one day they would be adapted for the screen. But Daniel, who wrote films like Won’t Back Down and Beastly, encouraged Zelda to write it as a TV show from the beginning. He taught Zelda how to write scripts, and the two bonded over creating the Genera+ion universe.“I will admit, there was a bit of craven, selfish desire [in creating a television show] because I thought if she was game to do it with me, what an amazing opportunity to do something creative with my daughter,” Daniel says. In his first stab at the teen genre, he serves as co-creator and executive producer. “And also to show her a little bit about the work that I do.” Given the generational gap, the father-daughter duo kept each other in check about queer issues to depict on screen and how to portray them realistically. Daniel says Zelda occasionally tells him “that’s not right” or “I don’t think that would really happen,” so he offers her a listening ear.Zelda was 17 at the time she first pitched Genera+ion to HBO, and although she admits the initial meeting was rather daunting, she decided she was simply going to have fun and go in with an easy-going attitude. “I remember walking into this huge conference room with this massive, long table,” Zelda says. “My dad and I stood on one side pitching and all these like HBO executives and Lena Dunham were on the other side watching. And I did not think that it was going to get bought or made. So I was just like, ‘I'm gonna have fun with it. I'm just going to do the best I can.’”Jennifer Clasen / HBO MaxThe show was given a full-season order, with Dunham serving as an executive producer. When casting for the show, Zelda and Daniel wanted to find actors with a youthful style. “We really wanted to make sure that these kids looked young and felt young, and that they didn't look like 30-year-old models playing teenagers,” Zelda says. “That was definitely a very helpful guideline to have when we were casting, and our cast is just beyond incredible.”Zelda’s stories and consciousness of contemporary issues have manifested into one of this year’s most hotly anticipated shows. With a gritty yet humorous tone, Genera+ion brings a no-holds-barred approach to depicting the lives and struggles of teens today. Daniel believes that parents can benefit from watching Genera+ion, noting that it would help facilitate open and honest conversations between parents and their children.“Sometimes there can be a dismissiveness about kids, which is so unfair,” Daniel says. “And it's something I've had to think about myself as a parent. And I feel like if parents can embrace that desire to look at their kids honestly and fairly, it would be amazing. I also think that, one of the reasons this show has been such a joy to work on is because Zelda and I have been able to communicate and talk honestly.” ", "author": "MTV News Staff"}, {"date": "2021-03-11T19:00:32Z", "title": "Grab The Popcorn! The MTV Movie & TV Awards Are Back", "full_article": "Little else got us through the blazing hellscape that was 2020 quite like movies and TV. While politicians hesitated to deliver sustainable coronavirus relief packages, mushy rom-coms, superhero action flicks, and fantasy adventures were there to hold you, distract you, and tell you everything would be OK. They've been a helpful reminder that a world existed before the pandemic — and that there will be one after it, too.That’s why the golden popcorn hits (tastes?) a little different this time around. The MTV Movie & TV Awards celebrate the biggest, the butteriest, and the most unbelievably outrageous in the business, and this installment is so massive that it can’t be contained to a single night. The show returns on Sunday, May 16, to toast the side-splitting, jaw-dropping moments — and the stars that brought them to life — that defined one unique year.But wait, there’s more: On Monday, May 17, MTV will air the first Movie & TV Awards: Unscripted, the first-ever ceremony celebrating all things reality TV. That’s right, the network that gave the world everything from the inclusive dating show Are You the One? to, well, Snooki will recap the messiest, most drama-filled moments ever to hit the screen. Break out the Earl Grey because this tea is scalding!The multi-day event follows the MTV Movie & TV Awards: Greatest of All Time special that aired in December, which expanded the annual showcase to include a celebration of the biggest on-screen moments literally ever. (Well, since the ’80s, but same thing, right?) All this to say, the MTV Movie & TV Awards, like our lives, are anything but traditional this year. So stay tuned in the coming weeks as hosts, honorees, performers, and presenters are announced. Mark your calendars and get that corn a-poppin’! ", "author": "MTV News Staff"}, {"date": "2021-03-11T18:12:00Z", "title": "Aaliyah Still Sounds Like The Future", "full_article": "By Yasmine ShemeshAn eponymous album marks a major moment in an artist's career. For women, owning one's work, body, and artistry can be especially powerful, even political. Throughout Women's History Month, MTV News is highlighting some of these iconic statements from some of the biggest artists on the globe. This is Self-Titled.In 2000, while filming scenes in the title role for Queen of the Damned in Australia, Aaliyah finished recording her third album. It had been in the works for a couple years — she reportedly completed most of it in New York before making her on-screen debut in that year’s Romeo Must Die and releasing “Try Again” as the soundtrack’s lead single. But despite the time gap, Aaliyah’s vision for her eponymous album remained clear: to expand the boundaries of her sound.“She told me specifically what kind of records she wanted,” singer-songwriter Tank, who wrote “I Can Be” and “What If” for Aaliyah, told the music blog YouKnowIGotSoul in 2011. “She kind of wanted a little dangerous, a little sexy, that type of thing.”Tank, with other co-writers and producers for the album including Static Major, Bud’da, J.Dub, Key Beats, and Playa, hunkered down in Melbourne’s Sing Sing Studios for about a month. Aaliyah, who filmed her scenes as the evil vampire Queen Akasha during the day, joined them in the evenings. When the album was released on July 7, 2001, it debuted at No. 2 on the Billboard 200. It received rave reviews: Vibe called it “the best soul album of the young millennium,” while Spin described Aaliyah as a “musicologist” who creates “meaning outside the lyrics.”https://www.youtube.com/watch?v=A5AAcgtMjUIAaliyah was a continuation of the remarkable way the artist  surpassed herself with each release. While 1994’s Age Ain’t Nothing but a Number bridged her precocious mystique with new jack swing, 1996’s One in a Million highlighted Aaliyah’s hushed tones with thumping, stuttering rhythms in collaboration with creative soul mates Missy Elliott and Timbaland. Aaliyah took all that and fused it into a sophisticated soundscape at the bleeding edge of sonic innovation.Aaliyah’s forward-thinking musical outlook was representative of the enterprising artist she was — and the icon she so quickly became. As she developed her wide-ranging talent, her magnetic appeal flooded into other arenas: film, where she was cultivating a promising career, and fashion, where her laid-back, sensual style made her a muse for designers like Tommy Hilfiger. He even launched a whole campaign around her wearing baggy jeans with an exposed waistband and bandeau top, the success of which inspired the brand’s women’s line. Importantly, Aaliyah was an inspiration for kids coming of age everywhere who saw glimpses of themselves in her.Considering the ingenuity of Aaliyah, it’s no wonder. The production was mind-bending, characterized by a cybernated sonic freakiness, and the way Aaliyah pulled humanity out of digitized ones and zeroes is a master class in nuance. “We were trying to do as much as we could and try to put an album together for her to be able to hear and see what she felt,” Bud’da recalled.Aaliyah’s honeyed falsetto was more robust and urgent than ever as she explored relationship dynamics and intimacy in Timbaland’s twitchy syncopation (“We Need a Resolution,” “More Than a Woman”), desire in shimmering synthesizers (“Rock the Boat”), liberation in swelling staccato (“I Refuse”), and jealousy in glitchy, industrial chaos (“What If”).https://www.youtube.com/watch?v=3NLUthL6-BU“There are a lot of great flavors on the album,” Aaliyah said in an interview with the Orlando Sentinel. “It's older, it's edgy, it's raw, yet it's a little bit of fun. I want to tell people where I am as a person in my life today.”When Aaliyah was released, nothing sounded quite like it. TLC and Destiny’s Child had played with staticky accents on Fanmail and The Writing’s on the Wall, respectively — a trend that Aaliyah herself spurred with One in a Million — but Aaliyah was avant-garde. Weirder, in an electrifying kind of way; as Vibe described: “damn near post-R&B.”It’s still impossible to fathom what happened next. Just a month after Aaliyah was released, returning home from the Bahamas where she shot the music video for “Rock the Boat,” Aaliyah and eight other passengers lost their lives in a plane crash. She was only 22. The indelible mark she made on contemporary R&B and pop culture, at large, in such a short period of time had been so immediate: Aaliyah stretched the bounds of what R&B could sound like in a way that redefined the genre, while helping inform sonic trends of the early 2000s. Twenty years after the release of the album as well as her tragic death, the force of that impact still reverberates.It’s not difficult to hear the direct influence Aaliyah made on the generation that followed her. Artists like Kehlani, Tinashe, Ciara, and Rihanna have taken audible cues from Aaliyah’s soft vocal phrasing and left-of-center song qualities. \"We owe our chill vibe to her,\" Tinashe told Billboard. \"People were used to artists belting things out. She brought a new vocal styling that wasn’t represented in R&B. Not everything has to be so uptempo.\" Drake is one of Aaliyah’s loudest devotees, sampling her music (“Unforgettable”), referencing her in lyrics (“BedRock”), and rapping to her previously unreleased tracks (“Enough Said”). FKA Twigs channeled Aaliyah outright in “Two Weeks,” pairing her sweet tone against anxious percussion and then paying music video homage to Queen of the Damned in full Queen Akasha regalia.“The new generation pulls inspiration from Aaliyah, despite not growing up with her, because she was authentic,\" Missy Elliott said in 2014. \"Her music couldn’t be placed in a category.\"KMazur/WireImageIndeed, perhaps the best indicator of Aaliyah’s influence is how it has extended into more unexpected musical territories like dubstep — which, bearing in mind the experimental nature of her work, isn’t all that surprising. On “In McDonalds,” electronic maestro Burial pitch-shifted Aaliyah’s “I Refuse” into a whispering siren that cut through enigmatic sparsity. James Blake sampled “Are You That Somebody?” to form the foundation of his airy post-dubstep anthem “CMYK.”Such a sweeping compass is one reason why Aaliyah’s lack of visibility on streaming platforms feels so glaring. The majority of her catalog isn’t available on any service. Aaliyah and One in a Million can be found on YouTube; there are bootlegs floating around the internet and random songs on Spotify featured on obscure compilations like R&B Divas and Girls of Hip Hop, Vol. 1. The only Aaliyah album currently available to stream is her first, Age Ain’t Nothing but a Number, which was written and produced by R. Kelly; in 2019, Kelly faced charges of bribing an Illinois official in order to procure a fake ID for the then-15-year-old Aaliyah in order to marry her. He is currently imprisoned awaiting a trail on charges of racketeering and child pornography.Journalist Stephen Witt traces the streaming obstacle back to Aaliyah’s uncle, Barry Hankerson, who owns most of her discography through his now-defunct Blackground Records imprint and who seems unwilling to release it. There are also issues with the fact that her three albums were each distributed through different labels.But with streaming as today’s primary avenue of musical consumption, if Aaliyah’s music isn’t accessible in our all-but-entirely digital era, younger generations who didn’t grow up with it won’t have the chance to truly discover it — no matter who cites Aaliyah as an influence or takes her fashion notes or celebrates the impact she made. As Witt writes, this runs a dangerous risk that Aaliyah will be forgotten. “Nostalgia is cyclical,” he adds, and “if Aaliyah's catalog isn't on the right platforms, her music could functionally cease to exist.”https://twitter.com/MTVNEWS/status/1362820654630903809Last summer, it seemed like things started moving along, albeit slowly. Aaliyah’s estate gave a statement saying communication had begun regarding the status of her music and its streaming availability. This January, another statement thanked fans for their patience and support: “We must acknowledge that these matters are not within our control and, unfortunately, take time.”For those who loved her or still have yet to discover her, hopefully we’re a step closer to having Aaliyah’s music at our fingertips. In the meantime, her voice can still be heard in the musical landscape she helped revolutionize, as well as through the multidimensional trajectory of her legacy — to be sure, a distinction she wanted all along.“I want people to see me as an entertainer,” Aaliyah considered in a 2001 interview with MTV News. “Someone who can do it all. I want people to look at me as a full-on entertainer.” She paused, then smiled. “And a good person.” ", "author": "MTV News Staff"}, {"date": "2021-03-11T16:14:06Z", "title": "#TBT: How JWOWW Introduced Her Now-Fiancé To The Jersey Shore Cast", "full_article": "Jenni \"JWOWW\" Farley \"said yes\" to Zack Carpinello -- and the bride's Jersey Shore family offered their congratulations to the soon-to-be husband and wife.https://www.instagram.com/p/CMNq0lCl6jS/\"So beyond happy for you two!!!! You deserve all the happiness in the world love you J! Congrats to you both!!!!!\" Deena commented on the announcement above, while Pauly D offered \"Congrats to you both!!!!!\" Snooki wrote, \"Love you guys so much,\" and Lauren added, \"I’m so excited for you two!! Love you guys! Cheers to forever!\"But it wasn't long ago (Season 3 of the hit MTV series, to be exact), that Jenni was gushing about being \"madly in love\" with her then 24-year-old beau and introducing 24 him to everyone in Las Vegas. \"There he is\" -- and nobody some of the fam acted \"normal.\"https://www.youtube.com/watch?v=sAxL2ULgA-wRelive the memorable Sin City sit-down above, and stay with MTV News for updates on the Farley-Carpinello nuptials! ", "author": "Jordana Ossad"}, {"date": "2021-03-11T04:00:01Z", "title": "Nany Renewed: Is The Winless Challenge Favorite Finally Headed Toward Victory?", "full_article": "If \"close but no cigar\" had a human Challenge equivalent, it might look like Nany. The Real World: Las Vegas export consistently plays solid games, only to watch them unravel at the 99-yard line.But things seemed to shift on the latest Double Agents episode, and now that Nany’s officially claimed her Gold Skull, is it her luck finally changing, and could Season 36 be hers for the taking?After Devin and Josh were both eliminated as part of a shocking Challenge Security Breach, players began to feel especially hungry for the win…that is, until they were introduced to the next mission, “Survive the Night.” As part of the game, players — equipped with very little information — were chained together, trapped in cages and told they needed to escape.How, exactly? By eating ram testicles, munching on fermented shark and solving a few math equations before breaking out of their cells with small saws.Naturally!Long story short: Most of the game’s players weren’t so down for the buffet…that is, except Kaycee and Leroy, who chewed through the mission like it was cotton candy and racked up their third win as partners.It was a disappointment to Gabby, Nany and Big T, each of whom had yet to earn a Gold Skull. But with her two biggest allies in positions of power, Nany was convinced she’d finally get a shot to win an elimination round, her first since Rivals III.“Season after season, it’s the same song and dance: I go home right before the final,” Nany said. “For me, this is everything.”Thankfully for Nany and Gabby, things went exactly as planned: Gabby and Cory earned the house’s Crater vote, while Leroy and Kaycee nominated Nany and Kyle. And in “Ring of Spies,” Gabby and Nany learned they’d have to be as swift as they were strong to snatch the win.In the best-of-three game, Nany and Gabby had to race to a suspended ring in the middle of the Crater, grab it and return it to a designated home base, plowing through their opponent en route if necessary. And for Gabby, a personal trainer, the game seemed a sure thing, as she carried Nany and the ring all the way to her post to earn her first point.“There’s this moment where we lock eyes with each other,” Gabby said. “I need to stop playing nice.”But something shifted after Gabby’s first point: Nany got tough too. Typically one to get frazzled by an early speedbump, Nany, instead, used the misstep as fuel, gritted her teeth and fought.“In past eliminations, the moment I feel like I’m losing, I become mentally defeated,” Nany said. “This time, I refuse to let that happen.”And after one of the best elimination rounds of the season, and two come-from-behind points, Nany won, earning the final women’s Gold Skull.“Words can’t even describe how I feel right now,” she said as she broke down in tears.Now, Nany, who proceeded to steal Fessy as a partner from Aneesa as part of her prize package, is in a solid spot. So can she keep riding the wave and win The Challenge? Or is it too soon to call, and is there still a chance she might stumble before it’s all over? Share your thoughts, and be sure to check out the next Double Agents episode Wednesday!  ", "author": "Matthew Scott Donnelly"}]